app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
  def index
    @apartments = Apartment.all

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 ORDER BY "apartments"."id" ASC LIMIT $2  [["id", 281286022], ["LIMIT", 1]]
---
  def show
    @apartment = Apartment.find(params[:id])

UPDATE "users" SET "updated_at" = $1, "apartment_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-03-05 20:35:14.833193"], ["apartment_id", 281286022], ["id", 980190962]]
---
  def occupy
    current_user.apartment_id = @apartment.id
    respond_to do |format|
      if current_user.save

INSERT INTO "apartments" ("street_address", "bedrooms", "rent", "notes", "neighborhood_id", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @apartment = Apartment.new(apartment_params)

    respond_to do |format|
      if @apartment.save

DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 281286022]]
---
  def destroy
    @apartment.destroy!

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 ORDER BY "apartments"."id" ASC LIMIT $2  [["id", 281286022], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 226565033], ["LIMIT", 1]]
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT $2  [["id", 934123410], ["LIMIT", 1]]
---
    def set_apartment
      @apartment = Apartment.where(id: params[:id]).includes(:city, :neighborhood).first

SELECT "cities".* FROM "cities"
SELECT "neighborhoods".* FROM "neighborhoods"
---
    def set_form_values
      @cities = City.all
      @neighborhoods = Neighborhood.all