app/controllers/apartment_requests_controller.rb

INSERT INTO "apartment_requests" ("apartment_id", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["apartment_id", 2], ["user_id", 6], ["status", 0], ["created_at", "2024-03-05 21:14:09.305979"], ["updated_at", "2024-03-05 21:14:09.305979"]]
---
    def create
      @apartment_request = @apartment.apartment_requests.new(applicant: current_user, status: :pending)

      if @apartment_request.save

DELETE FROM "apartment_requests" WHERE "apartment_requests"."id" = $1  [["id", 1]]
---
    def destroy
      @apartment_request.destroy

UPDATE "apartment_requests" SET "status" = $1 WHERE "apartment_requests"."user_id" = $2 AND "apartment_requests"."id" != $3 AND "apartment_requests"."status" = $4  [["status", 3], ["user_id", 4], ["id", 3], ["status", 0]]
---
    def update
        @apartment = @apartment_request.apartment
        if params[:status] == "approved"
          @apartment_request.approve
        elsif params[:status] == "denied"
          @apartment_request.deny
        else
          @apartment_request.update(status: params[:status])

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_apartment
      @apartment = Apartment.find(params[:apartment_id])

SELECT "apartment_requests".* FROM "apartment_requests" WHERE "apartment_requests"."apartment_id" = $1 AND "apartment_requests"."id" = $2 LIMIT $3  [["apartment_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def set_apartment_request
      @apartment_request = @apartment.apartment_requests.find(params[:id])