app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @apartment = Apartment.find(params[:id])

UPDATE "users" SET "updated_at" = $1, "apartment_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-03-05 22:31:18.969605"], ["apartment_id", 1], ["id", 3]]
---
  def occupy
    current_user.apartment_id = @apartment.id
    respond_to do |format|
      if current_user.save

UPDATE "users" SET "updated_at" = $1, "apartment_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-03-05 22:34:24.234812"], ["apartment_id", nil], ["id", 3]]
---
  def vacate
    current_user.apartment_id = nil
    respond_to do |format|
      if current_user.save

UPDATE "apartments" SET "bedrooms" = $1, "updated_at" = $2 WHERE "apartments"."id" = $3  [["bedrooms", 2], ["updated_at", "2024-03-05 23:08:07.414288"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @apartment.update(apartment_params)

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 ORDER BY "apartments"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1  [["id", 2]]
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1  [["id", 2]]
---
    def set_apartment
      @apartment = Apartment.where(id: params[:id]).includes(:city, :neighborhood).first