app/controllers/neighborhoods_controller.rb

  def index
    @neighborhoods = @city.neighborhoods.all
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."city_id" = $1  [["city_id", 226565033]]

  def create
    @neighborhood = @city.neighborhoods.build(neighborhood_params)

    respond_to do |format|
      if @neighborhood.save
---
INSERT INTO "neighborhoods" ("name", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Back Bay"], ["city_id", 226565033], ["created_at", "2024-03-05 20:35:15.691876"], ["updated_at", "2024-03-05 20:35:15.691876"]]

  def destroy
    @neighborhood.destroy!
---
DELETE FROM "neighborhoods" WHERE "neighborhoods"."id" = $1  [["id", 934123410]]

    def set_neighborhood
      @neighborhood = @city.neighborhoods.find(params[:id])
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."city_id" = $1 AND "neighborhoods"."id" = $2 LIMIT $3  [["city_id", 226565033], ["id", 934123410], ["LIMIT", 1]]

    def set_city
      @city = City.find(params[:city_id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 226565033], ["LIMIT", 1]]

    def set_form_values
      @cities = City.all
---
SELECT "cities".* FROM "cities"