app/controllers/register_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "apartment_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "test@test.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-03-05 18:41:30.365488"], ["updated_at", "2024-03-05 18:41:30.365488"], ["apartment_id", nil]]
---
  def create
    @user = User.new(user_params)
    if @user.save