app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jon@jonphillips.com"], ["LIMIT", 1]]