app/views/cities/show.html.erb

      <ul>
        <% @city.neighborhoods.each do |neighborhood| %>
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."city_id" = $1  [["city_id", 1]]

      <tbody>
        <% @city.apartments.each do |apartment| %>
---
SELECT "apartments".* FROM "apartments" WHERE "apartments"."city_id" = $1  [["city_id", 1]]