app/models/apartment_request.rb

UPDATE "apartment_requests" SET "status" = $1 WHERE "apartment_requests"."user_id" = $2 AND "apartment_requests"."id" != $3 AND "apartment_requests"."status" = $4  [["status", 3], ["user_id", 4], ["id", 3], ["status", 0]]
---
  def approve
    transaction do
      update(status: :approved)
      applicant.apartment_requests.where.not(id: id).pending.update_all(status: :superseded)